; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	satellite7 - satellite
	instrument14 - instrument
	instrument15 - instrument
	satellite8 - satellite
	instrument16 - instrument
	satellite9 - satellite
	instrument17 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument7 spectrograph0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument8 thermograph1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 thermograph1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 spectrograph0)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument11 spectrograph0)
	(calibration_target instrument11 Star2)
	(supports instrument12 spectrograph0)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation1)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet7)
	(supports instrument13 thermograph1)
	(supports instrument13 spectrograph0)
	(calibration_target instrument13 GroundStation3)
	(on_board instrument13 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet7)
	(supports instrument14 spectrograph0)
	(supports instrument14 thermograph1)
	(calibration_target instrument14 Star2)
	(supports instrument15 spectrograph0)
	(supports instrument15 thermograph1)
	(calibration_target instrument15 Star2)
	(on_board instrument14 satellite7)
	(on_board instrument15 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star9)
	(supports instrument16 spectrograph0)
	(supports instrument16 thermograph1)
	(calibration_target instrument16 GroundStation4)
	(on_board instrument16 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Phenomenon5)
	(supports instrument17 thermograph1)
	(calibration_target instrument17 Star2)
	(on_board instrument17 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Star0)
)
(:goal (and
	(pointing satellite2 GroundStation4)
	(pointing satellite3 Star9)
	(have_image Phenomenon5 thermograph1)
	(have_image Star6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Phenomenon8 thermograph1)
	(have_image Star9 spectrograph0)
	(have_image Star10 thermograph1)
))

)

; plan
1. (turn_to satellite3 groundstation3 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 8
3. (calibrate satellite3 instrument7 groundstation3)
   added: (calibrated instrument7)
   goals met: 0 of 8
4. (turn_to satellite3 star10 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star10)
   goals met: 0 of 8
5. (take_image satellite3 star10 instrument7 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite3 planet7 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet7)
   goals met: 1 of 8
7. (take_image satellite3 planet7 instrument7 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 2 of 8
8. (turn_to satellite3 phenomenon8 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 phenomenon8)
   goals met: 2 of 8
9. (take_image satellite3 phenomenon8 instrument7 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 3 of 8
10. (turn_to satellite3 phenomenon5 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon5)
   goals met: 3 of 8
11. (take_image satellite3 phenomenon5 instrument7 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 4 of 8
12. (turn_to satellite2 groundstation4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation4)
   goals met: 5 of 8
13. (turn_to satellite3 star6 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 star6)
   goals met: 5 of 8
14. (take_image satellite3 star6 instrument7 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 6 of 8
15. (turn_to satellite3 star9 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star9)
   goals met: 7 of 8
16. (take_image satellite3 star9 instrument7 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 8 of 8
